frontend/controllers/SiteController.php

SELECT * FROM `filter`
SELECT * FROM `slices`
SELECT * FROM `pages` WHERE `name`='index'
---
    public function actionIndex()
    {
        $filter_model = Filter::find()->with('items')->all();
        $slices_model = Slices::find()->all();
        $widgets_model = WidgetMain::find()->with('slice')->all();

        $apiMain = new ApiMain;
        $apiMain = $apiMain->getMain($widgets_model, $filter_model, $slices_model);

        $seo = Pages::find()->where(['name' => 'index'])->one();