frontend/components/QueryFromSlice.php

	public function __construct($slice) {
		$slice_model = Slices::find()->where(['alias' => $slice])->one();
---
SELECT * FROM `slices` WHERE `alias`='v-podmoskovie'