<?php

return [
    'First' => 'Первая',
    'Last' => 'Последняя',
    'Create' => 'Создать',
    'Save' => 'Сохранить',
    'Select' => 'Выбрать',
    'Search' => 'Поиск',
    'Reset' => 'Сброс',
    'View' => 'Просмотр',
    'Edit' => 'Редактировать',
    'Copy' => 'Копировать',
    'Delete' => 'Удалить',
    'List All' => 'Просмотр всех',
    'Full list' => 'Полный список',
    'List' => 'Список',
    'Cancel' => 'Отмена',
    'Are you sure to delete this item?' => "Вы уверены что хотите удалить это?",

    'New' => 'Добавить',
    'Relations' => 'Связи',
];
